src/assets/requests/set_password.xml

<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP:Body>
      <SetPassword xmlns="http://schemas.cordys.com/user/password/1.0" xmlns:xfr="http://schemas.cordys.com/1.0/xforms/runtime">
         <OldPassword />
         <NewPassword />
      </SetPassword>
   </SOAP:Body>
</SOAP:Envelope>